namespace Models;

// همانطور که قبلا گفتم به صورت پیش فرض یه سری از کدها مثل object یا base() توسط کامپایلر نوشته میشود
// برنامه نویس ها برای اینکه کدشان شلوغ نشود این کدها را نمینویسند.
// در گذشته به علت مشکلاتی که با تغییر ورژن VS بوجود می آمد. برنامه نویس ها این موارد را مینوشتند. تا راحت تر باگ های احتمالی را رفع کنند
// با توجه به اینکه از لحاظ آموزشی میتواند مفید باشد. پس سعی میکنم تمام مواردی که کامپایلر برداشت میکند را بنویسم
public class Person : object
{
	public Person() : base()
	{

	}
	// **** **** **** ****
	// میتوان برای PK از سه متغیر int, long, guid استفاده کرد.
	// در این مثال چون از نوع int است Auto Increment است
	public int Id { get; set; }
	// **** **** **** ****

	// **** **** **** ****
	public string? Name { get; set; }
	// **** **** **** ****
}

